---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.LipLength
source: html/cbdb5460-ca39-0a5b-e965-97fa4f12822b.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ.LipLength Property

Lip segment length.

## Syntax (C#)
```csharp
public double LipLength { get; set; }
```